<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"d7a35cc83786d639beaaeb50d73f21e93deac652f4847318c9e4753bbfa962f4","plan_job_ref":"Job Pull Request Checks #4692 at https://github.com/GSA-TTS/FAC/actions/runs/14537162156","plan_out_hash":"a6a92efdedac14c2d9f43f812786577c0b11e381f7ed8f4534c083aa60832037","plan_hash":"c40c05a89f2bd7d702cbc5c511de17b6b297ebd6cab8acf8ef9da705d3e9a7a6","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be updated in-place
!~  resource "cloudfoundry_route" "origin_route_connected" {
!~      destinations = [
-           {
-               app_id           = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
-               app_process_type = "web" -> null
-               id               = "385848b8-a75a-40f9-9d6a-0c08bf152f14" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d27762e1-9428-4cfb-b39b-f85710a489fc"
#        (7 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-17T18:19:02Z" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4692](https://github.com/GSA-TTS/FAC/actions/runs/14537162156)